Implementación Tiendita/POJO's/tstTiendita/src/META-INF/wsdl/localhost_9080/TienditaWSDLService/TienditaWSDLPort.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="TienditaWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/Tiendita/DescriptorWSDL/TienditaWSDL" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://j2ee.netbeans.org/wsdl/Tiendita/DescriptorWSDL/TienditaWSDL" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
  </types>
  <message name="TienditaWSDLOperationResponse">
    <part name="RESPONSE" type="xsd:string">
    </part>
  </message>
  <message name="TienditaWSDLOperationRequest">
    <part name="CUSTOMER_ID" type="xsd:int">
    </part>
    <part name="PRODUCT_ID" type="xsd:int">
    </part>
    <part name="QUANTITY" type="xsd:int">
    </part>
  </message>
  <portType name="TienditaWSDLPortType">
    <operation name="TienditaWSDLOperation">
      <input name="input1" message="tns:TienditaWSDLOperationRequest">
    </input>
      <output name="output1" message="tns:TienditaWSDLOperationResponse">
    </output>
    </operation>
  </portType>
  <binding name="TienditaWSDLBinding" type="tns:TienditaWSDLPortType">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="TienditaWSDLOperation">
      <soap:operation/>
      <input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Tiendita/DescriptorWSDL/TienditaWSDL"/>
      </input>
      <output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Tiendita/DescriptorWSDL/TienditaWSDL"/>
      </output>
    </operation>
  </binding>
  <service name="TienditaWSDLService">
    <port name="TienditaWSDLPort" binding="tns:TienditaWSDLBinding">
      <soap:address location="http://CC202-09.itam.mx:9080/TienditaWSDLService/TienditaWSDLPort"/>
    </port>
  </service>
    <plnk:partnerLinkType name="TienditaWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="TienditaWSDLPortTypeRole" portType="tns:TienditaWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
